{
  "tokens": [
    "<pad>",
    "<unk>",
    "<bos>",
    "<eos>",
    "[C]",
    "[=C]",
    "[Branch1]",
    "[Ring1]",
    "[N]",
    "[O]",
    "[=Branch1]",
    "[=O]",
    "[=N]",
    "[#Branch1]",
    "[S]",
    "[Branch2]",
    "[=Branch2]",
    "[F]",
    "[#Branch2]",
    "[#C]",
    "[Cl]",
    "[Ring2]",
    "[CH0]",
    "[NH0]",
    "[NH1]",
    "[#N]",
    "[P]",
    "[O-1]",
    "[OH0]",
    "[CH1]",
    "[N+1]",
    "[H]",
    "[Br]",
    "[Si]",
    "[SH1]",
    "[=S]",
    "[B]",
    "[=N+1]",
    "[CH2]",
    "[=SH1]",
    "[PH1]",
    "[SH0]",
    "[=CH0]",
    "[BH0]",
    "[=P]",
    "[Se]",
    "[PH0]",
    "[SiH1]",
    "[SiH2]",
    "[Ge]",
    "[As]",
    "[=NH0]",
    "[SiH3]",
    "[=Si]",
    "[=PH0]",
    "[=PH1]",
    "[BH1]",
    "[SeH1]",
    "[GeH3]",
    "[=Ring1]",
    "[#SH0]",
    "[=SiH1]",
    "[GeH1]",
    "[GeH2]",
    "[SH2]",
    "[PH2]",
    "[Al]",
    "[=PH2]",
    "[AsH1]",
    "[=SeH1]",
    "[AsH2]",
    "[OH1]",
    "[=SiH2]",
    "[#CH0]",
    "[=CH1]",
    "[NH2]",
    "[PH3]",
    "[PH4]",
    "[AlH1]",
    "[Ga]",
    "[SH3]",
    "[Ti]",
    "[=PH3]",
    "[BH2]",
    "[Li]",
    "[GeH4]",
    "[Mg]",
    "[Na]",
    "[SiH4]",
    "[#Ti]",
    "[=Ti]",
    "[BeH1]",
    "[Be]",
    "[Cu]",
    "[SeH2]",
    "[V]",
    "[Zn]",
    "[#Sc]",
    "[#Zn]",
    "[=Ca]",
    "[=Ni]",
    "[=Ring2]",
    "[AlH2]",
    "[AlH3]",
    "[AsH3]",
    "[CH3]",
    "[Fe]",
    "[GaH1]",
    "[GaH2]"
  ],
  "token_to_id": {
    "<pad>": 0,
    "<unk>": 1,
    "<bos>": 2,
    "<eos>": 3,
    "[C]": 4,
    "[=C]": 5,
    "[Branch1]": 6,
    "[Ring1]": 7,
    "[N]": 8,
    "[O]": 9,
    "[=Branch1]": 10,
    "[=O]": 11,
    "[=N]": 12,
    "[#Branch1]": 13,
    "[S]": 14,
    "[Branch2]": 15,
    "[=Branch2]": 16,
    "[F]": 17,
    "[#Branch2]": 18,
    "[#C]": 19,
    "[Cl]": 20,
    "[Ring2]": 21,
    "[CH0]": 22,
    "[NH0]": 23,
    "[NH1]": 24,
    "[#N]": 25,
    "[P]": 26,
    "[O-1]": 27,
    "[OH0]": 28,
    "[CH1]": 29,
    "[N+1]": 30,
    "[H]": 31,
    "[Br]": 32,
    "[Si]": 33,
    "[SH1]": 34,
    "[=S]": 35,
    "[B]": 36,
    "[=N+1]": 37,
    "[CH2]": 38,
    "[=SH1]": 39,
    "[PH1]": 40,
    "[SH0]": 41,
    "[=CH0]": 42,
    "[BH0]": 43,
    "[=P]": 44,
    "[Se]": 45,
    "[PH0]": 46,
    "[SiH1]": 47,
    "[SiH2]": 48,
    "[Ge]": 49,
    "[As]": 50,
    "[=NH0]": 51,
    "[SiH3]": 52,
    "[=Si]": 53,
    "[=PH0]": 54,
    "[=PH1]": 55,
    "[BH1]": 56,
    "[SeH1]": 57,
    "[GeH3]": 58,
    "[=Ring1]": 59,
    "[#SH0]": 60,
    "[=SiH1]": 61,
    "[GeH1]": 62,
    "[GeH2]": 63,
    "[SH2]": 64,
    "[PH2]": 65,
    "[Al]": 66,
    "[=PH2]": 67,
    "[AsH1]": 68,
    "[=SeH1]": 69,
    "[AsH2]": 70,
    "[OH1]": 71,
    "[=SiH2]": 72,
    "[#CH0]": 73,
    "[=CH1]": 74,
    "[NH2]": 75,
    "[PH3]": 76,
    "[PH4]": 77,
    "[AlH1]": 78,
    "[Ga]": 79,
    "[SH3]": 80,
    "[Ti]": 81,
    "[=PH3]": 82,
    "[BH2]": 83,
    "[Li]": 84,
    "[GeH4]": 85,
    "[Mg]": 86,
    "[Na]": 87,
    "[SiH4]": 88,
    "[#Ti]": 89,
    "[=Ti]": 90,
    "[BeH1]": 91,
    "[Be]": 92,
    "[Cu]": 93,
    "[SeH2]": 94,
    "[V]": 95,
    "[Zn]": 96,
    "[#Sc]": 97,
    "[#Zn]": 98,
    "[=Ca]": 99,
    "[=Ni]": 100,
    "[=Ring2]": 101,
    "[AlH2]": 102,
    "[AlH3]": 103,
    "[AsH3]": 104,
    "[CH3]": 105,
    "[Fe]": 106,
    "[GaH1]": 107,
    "[GaH2]": 108
  },
  "id_to_token": {
    "0": "<pad>",
    "1": "<unk>",
    "2": "<bos>",
    "3": "<eos>",
    "4": "[C]",
    "5": "[=C]",
    "6": "[Branch1]",
    "7": "[Ring1]",
    "8": "[N]",
    "9": "[O]",
    "10": "[=Branch1]",
    "11": "[=O]",
    "12": "[=N]",
    "13": "[#Branch1]",
    "14": "[S]",
    "15": "[Branch2]",
    "16": "[=Branch2]",
    "17": "[F]",
    "18": "[#Branch2]",
    "19": "[#C]",
    "20": "[Cl]",
    "21": "[Ring2]",
    "22": "[CH0]",
    "23": "[NH0]",
    "24": "[NH1]",
    "25": "[#N]",
    "26": "[P]",
    "27": "[O-1]",
    "28": "[OH0]",
    "29": "[CH1]",
    "30": "[N+1]",
    "31": "[H]",
    "32": "[Br]",
    "33": "[Si]",
    "34": "[SH1]",
    "35": "[=S]",
    "36": "[B]",
    "37": "[=N+1]",
    "38": "[CH2]",
    "39": "[=SH1]",
    "40": "[PH1]",
    "41": "[SH0]",
    "42": "[=CH0]",
    "43": "[BH0]",
    "44": "[=P]",
    "45": "[Se]",
    "46": "[PH0]",
    "47": "[SiH1]",
    "48": "[SiH2]",
    "49": "[Ge]",
    "50": "[As]",
    "51": "[=NH0]",
    "52": "[SiH3]",
    "53": "[=Si]",
    "54": "[=PH0]",
    "55": "[=PH1]",
    "56": "[BH1]",
    "57": "[SeH1]",
    "58": "[GeH3]",
    "59": "[=Ring1]",
    "60": "[#SH0]",
    "61": "[=SiH1]",
    "62": "[GeH1]",
    "63": "[GeH2]",
    "64": "[SH2]",
    "65": "[PH2]",
    "66": "[Al]",
    "67": "[=PH2]",
    "68": "[AsH1]",
    "69": "[=SeH1]",
    "70": "[AsH2]",
    "71": "[OH1]",
    "72": "[=SiH2]",
    "73": "[#CH0]",
    "74": "[=CH1]",
    "75": "[NH2]",
    "76": "[PH3]",
    "77": "[PH4]",
    "78": "[AlH1]",
    "79": "[Ga]",
    "80": "[SH3]",
    "81": "[Ti]",
    "82": "[=PH3]",
    "83": "[BH2]",
    "84": "[Li]",
    "85": "[GeH4]",
    "86": "[Mg]",
    "87": "[Na]",
    "88": "[SiH4]",
    "89": "[#Ti]",
    "90": "[=Ti]",
    "91": "[BeH1]",
    "92": "[Be]",
    "93": "[Cu]",
    "94": "[SeH2]",
    "95": "[V]",
    "96": "[Zn]",
    "97": "[#Sc]",
    "98": "[#Zn]",
    "99": "[=Ca]",
    "100": "[=Ni]",
    "101": "[=Ring2]",
    "102": "[AlH2]",
    "103": "[AlH3]",
    "104": "[AsH3]",
    "105": "[CH3]",
    "106": "[Fe]",
    "107": "[GaH1]",
    "108": "[GaH2]"
  }
}