{
  "tokens": [
    "<pad>",
    "<unk>",
    "<bos>",
    "<eos>",
    "C",
    "",
    "=",
    "(",
    ")",
    "1",
    "N",
    "O",
    "2",
    "[C@@H]",
    "[C@H]",
    "F",
    "S",
    "Cl",
    "3",
    "[C]",
    "[N]",
    "[NH]",
    "[C@]",
    "[C@@]",
    "[N+]",
    "[O-]",
    "[O]",
    "[CH]",
    "[H]",
    "Br",
    "[Si]",
    "P",
    "[SH]",
    "B",
    "4",
    "[S@H]",
    "[CH2]",
    "[S@@H]",
    "[P@]",
    "[S]",
    "[PH]",
    "[B]",
    "[P@@]",
    "[P]",
    "[Se]",
    "5",
    "[SiH]",
    "[SiH2]",
    "[Si@]",
    "[Si@@]",
    "[Ge]",
    "[As]",
    "[SiH3]",
    "[Si@@H]",
    "6",
    "[S@]",
    "[S@@]",
    "[Si@H]",
    "[P@H]",
    "[SeH]",
    "[S@OH18]",
    "[P@@H]",
    "[BH]",
    "[P@TB2]",
    "[S@TB16]",
    "[GeH3]",
    "[P@TB19]",
    "[S@TB17]",
    "[P@TB17]",
    "[PH2]",
    "[P@TB4]",
    "[S@TB20]",
    "[P@TB13]",
    "[P@TB14]",
    "[GeH2]",
    "[GeH]",
    "[S@SP3H]",
    "[SH2]",
    "[P@TB6]",
    "[S@TB19]",
    "[S@TB6]",
    "[P@TB9]",
    "7",
    "[P@TB10]",
    "[S@TB4]",
    "[P@TB7]",
    "[P@TB18]",
    "[S@TB5]",
    "[Al]",
    "[S@TB18]",
    "[S@OH23]",
    "[S@SP2]",
    "[AsH]",
    "[S@TB3]",
    "[P@TB12]",
    "[S@OH6]",
    "[S@TB2]",
    "[AsH2]",
    "[P@TB15]",
    "[P@TB20]",
    "[PH3]",
    "[S@OH26]",
    "[OH]",
    "[P@TB3]",
    "[S@TB1]",
    "[P@TB1]",
    "[P@TB8]",
    "[S@OH21]",
    "[Ti]",
    "[NH2]",
    "[P@TB16]",
    "[S@OH16]",
    "[Ge@@]",
    "[P@TB5]",
    "[PH4]",
    "[S@OH15]",
    "[S@OH20]",
    "[AlH]",
    "[Ga]",
    "[S@OH24]",
    "[S@OH3]",
    "[S@OH5]",
    "[S@SP3]",
    "[S@TB15]",
    "[SH3]",
    "8",
    "[BH2]",
    "[Li]",
    "[P@TB11]",
    "[S@SP1]",
    "[GeH4]",
    "[Mg]",
    "[Na]",
    "[S@OH12]",
    "[S@OH22]",
    "[S@OH28]",
    "[SiH4]",
    "[Zn]",
    "[BeH]",
    "[Be]",
    "[Cu]",
    "[Ge@]",
    "[P@SP2]",
    "[P@TB5H]",
    "[S@OH29]",
    "[S@SP1H]",
    "[SeH2]",
    "[V]",
    "[AlH2]",
    "[AlH3]",
    "[AsH3]",
    "[CH3]",
    "[Ca]",
    "[Fe]",
    "[GaH2]",
    "[GaH]",
    "[Ge@@H]",
    "[Ge@TB3]",
    "[Ni]",
    "[P@@H2]",
    "[P@TB6H]",
    "[S@OH11]",
    "[S@OH17]",
    "[S@OH27]",
    "[S@OH7]",
    "[S@SP2H]",
    "[Sc]"
  ],
  "token_to_id": {
    "<pad>": 0,
    "<unk>": 1,
    "<bos>": 2,
    "<eos>": 3,
    "C": 4,
    "": 5,
    "=": 6,
    "(": 7,
    ")": 8,
    "1": 9,
    "N": 10,
    "O": 11,
    "2": 12,
    "[C@@H]": 13,
    "[C@H]": 14,
    "F": 15,
    "S": 16,
    "Cl": 17,
    "3": 18,
    "[C]": 19,
    "[N]": 20,
    "[NH]": 21,
    "[C@]": 22,
    "[C@@]": 23,
    "[N+]": 24,
    "[O-]": 25,
    "[O]": 26,
    "[CH]": 27,
    "[H]": 28,
    "Br": 29,
    "[Si]": 30,
    "P": 31,
    "[SH]": 32,
    "B": 33,
    "4": 34,
    "[S@H]": 35,
    "[CH2]": 36,
    "[S@@H]": 37,
    "[P@]": 38,
    "[S]": 39,
    "[PH]": 40,
    "[B]": 41,
    "[P@@]": 42,
    "[P]": 43,
    "[Se]": 44,
    "5": 45,
    "[SiH]": 46,
    "[SiH2]": 47,
    "[Si@]": 48,
    "[Si@@]": 49,
    "[Ge]": 50,
    "[As]": 51,
    "[SiH3]": 52,
    "[Si@@H]": 53,
    "6": 54,
    "[S@]": 55,
    "[S@@]": 56,
    "[Si@H]": 57,
    "[P@H]": 58,
    "[SeH]": 59,
    "[S@OH18]": 60,
    "[P@@H]": 61,
    "[BH]": 62,
    "[P@TB2]": 63,
    "[S@TB16]": 64,
    "[GeH3]": 65,
    "[P@TB19]": 66,
    "[S@TB17]": 67,
    "[P@TB17]": 68,
    "[PH2]": 69,
    "[P@TB4]": 70,
    "[S@TB20]": 71,
    "[P@TB13]": 72,
    "[P@TB14]": 73,
    "[GeH2]": 74,
    "[GeH]": 75,
    "[S@SP3H]": 76,
    "[SH2]": 77,
    "[P@TB6]": 78,
    "[S@TB19]": 79,
    "[S@TB6]": 80,
    "[P@TB9]": 81,
    "7": 82,
    "[P@TB10]": 83,
    "[S@TB4]": 84,
    "[P@TB7]": 85,
    "[P@TB18]": 86,
    "[S@TB5]": 87,
    "[Al]": 88,
    "[S@TB18]": 89,
    "[S@OH23]": 90,
    "[S@SP2]": 91,
    "[AsH]": 92,
    "[S@TB3]": 93,
    "[P@TB12]": 94,
    "[S@OH6]": 95,
    "[S@TB2]": 96,
    "[AsH2]": 97,
    "[P@TB15]": 98,
    "[P@TB20]": 99,
    "[PH3]": 100,
    "[S@OH26]": 101,
    "[OH]": 102,
    "[P@TB3]": 103,
    "[S@TB1]": 104,
    "[P@TB1]": 105,
    "[P@TB8]": 106,
    "[S@OH21]": 107,
    "[Ti]": 108,
    "[NH2]": 109,
    "[P@TB16]": 110,
    "[S@OH16]": 111,
    "[Ge@@]": 112,
    "[P@TB5]": 113,
    "[PH4]": 114,
    "[S@OH15]": 115,
    "[S@OH20]": 116,
    "[AlH]": 117,
    "[Ga]": 118,
    "[S@OH24]": 119,
    "[S@OH3]": 120,
    "[S@OH5]": 121,
    "[S@SP3]": 122,
    "[S@TB15]": 123,
    "[SH3]": 124,
    "8": 125,
    "[BH2]": 126,
    "[Li]": 127,
    "[P@TB11]": 128,
    "[S@SP1]": 129,
    "[GeH4]": 130,
    "[Mg]": 131,
    "[Na]": 132,
    "[S@OH12]": 133,
    "[S@OH22]": 134,
    "[S@OH28]": 135,
    "[SiH4]": 136,
    "[Zn]": 137,
    "[BeH]": 138,
    "[Be]": 139,
    "[Cu]": 140,
    "[Ge@]": 141,
    "[P@SP2]": 142,
    "[P@TB5H]": 143,
    "[S@OH29]": 144,
    "[S@SP1H]": 145,
    "[SeH2]": 146,
    "[V]": 147,
    "[AlH2]": 148,
    "[AlH3]": 149,
    "[AsH3]": 150,
    "[CH3]": 151,
    "[Ca]": 152,
    "[Fe]": 153,
    "[GaH2]": 154,
    "[GaH]": 155,
    "[Ge@@H]": 156,
    "[Ge@TB3]": 157,
    "[Ni]": 158,
    "[P@@H2]": 159,
    "[P@TB6H]": 160,
    "[S@OH11]": 161,
    "[S@OH17]": 162,
    "[S@OH27]": 163,
    "[S@OH7]": 164,
    "[S@SP2H]": 165,
    "[Sc]": 166
  },
  "id_to_token": {
    "0": "<pad>",
    "1": "<unk>",
    "2": "<bos>",
    "3": "<eos>",
    "4": "C",
    "5": "",
    "6": "=",
    "7": "(",
    "8": ")",
    "9": "1",
    "10": "N",
    "11": "O",
    "12": "2",
    "13": "[C@@H]",
    "14": "[C@H]",
    "15": "F",
    "16": "S",
    "17": "Cl",
    "18": "3",
    "19": "[C]",
    "20": "[N]",
    "21": "[NH]",
    "22": "[C@]",
    "23": "[C@@]",
    "24": "[N+]",
    "25": "[O-]",
    "26": "[O]",
    "27": "[CH]",
    "28": "[H]",
    "29": "Br",
    "30": "[Si]",
    "31": "P",
    "32": "[SH]",
    "33": "B",
    "34": "4",
    "35": "[S@H]",
    "36": "[CH2]",
    "37": "[S@@H]",
    "38": "[P@]",
    "39": "[S]",
    "40": "[PH]",
    "41": "[B]",
    "42": "[P@@]",
    "43": "[P]",
    "44": "[Se]",
    "45": "5",
    "46": "[SiH]",
    "47": "[SiH2]",
    "48": "[Si@]",
    "49": "[Si@@]",
    "50": "[Ge]",
    "51": "[As]",
    "52": "[SiH3]",
    "53": "[Si@@H]",
    "54": "6",
    "55": "[S@]",
    "56": "[S@@]",
    "57": "[Si@H]",
    "58": "[P@H]",
    "59": "[SeH]",
    "60": "[S@OH18]",
    "61": "[P@@H]",
    "62": "[BH]",
    "63": "[P@TB2]",
    "64": "[S@TB16]",
    "65": "[GeH3]",
    "66": "[P@TB19]",
    "67": "[S@TB17]",
    "68": "[P@TB17]",
    "69": "[PH2]",
    "70": "[P@TB4]",
    "71": "[S@TB20]",
    "72": "[P@TB13]",
    "73": "[P@TB14]",
    "74": "[GeH2]",
    "75": "[GeH]",
    "76": "[S@SP3H]",
    "77": "[SH2]",
    "78": "[P@TB6]",
    "79": "[S@TB19]",
    "80": "[S@TB6]",
    "81": "[P@TB9]",
    "82": "7",
    "83": "[P@TB10]",
    "84": "[S@TB4]",
    "85": "[P@TB7]",
    "86": "[P@TB18]",
    "87": "[S@TB5]",
    "88": "[Al]",
    "89": "[S@TB18]",
    "90": "[S@OH23]",
    "91": "[S@SP2]",
    "92": "[AsH]",
    "93": "[S@TB3]",
    "94": "[P@TB12]",
    "95": "[S@OH6]",
    "96": "[S@TB2]",
    "97": "[AsH2]",
    "98": "[P@TB15]",
    "99": "[P@TB20]",
    "100": "[PH3]",
    "101": "[S@OH26]",
    "102": "[OH]",
    "103": "[P@TB3]",
    "104": "[S@TB1]",
    "105": "[P@TB1]",
    "106": "[P@TB8]",
    "107": "[S@OH21]",
    "108": "[Ti]",
    "109": "[NH2]",
    "110": "[P@TB16]",
    "111": "[S@OH16]",
    "112": "[Ge@@]",
    "113": "[P@TB5]",
    "114": "[PH4]",
    "115": "[S@OH15]",
    "116": "[S@OH20]",
    "117": "[AlH]",
    "118": "[Ga]",
    "119": "[S@OH24]",
    "120": "[S@OH3]",
    "121": "[S@OH5]",
    "122": "[S@SP3]",
    "123": "[S@TB15]",
    "124": "[SH3]",
    "125": "8",
    "126": "[BH2]",
    "127": "[Li]",
    "128": "[P@TB11]",
    "129": "[S@SP1]",
    "130": "[GeH4]",
    "131": "[Mg]",
    "132": "[Na]",
    "133": "[S@OH12]",
    "134": "[S@OH22]",
    "135": "[S@OH28]",
    "136": "[SiH4]",
    "137": "[Zn]",
    "138": "[BeH]",
    "139": "[Be]",
    "140": "[Cu]",
    "141": "[Ge@]",
    "142": "[P@SP2]",
    "143": "[P@TB5H]",
    "144": "[S@OH29]",
    "145": "[S@SP1H]",
    "146": "[SeH2]",
    "147": "[V]",
    "148": "[AlH2]",
    "149": "[AlH3]",
    "150": "[AsH3]",
    "151": "[CH3]",
    "152": "[Ca]",
    "153": "[Fe]",
    "154": "[GaH2]",
    "155": "[GaH]",
    "156": "[Ge@@H]",
    "157": "[Ge@TB3]",
    "158": "[Ni]",
    "159": "[P@@H2]",
    "160": "[P@TB6H]",
    "161": "[S@OH11]",
    "162": "[S@OH17]",
    "163": "[S@OH27]",
    "164": "[S@OH7]",
    "165": "[S@SP2H]",
    "166": "[Sc]"
  }
}